app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles"

  def show
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "Skibidi"], ["body", "Sigma pomni"], ["created_at", "2024-08-05 10:12:07.771889"], ["updated_at", "2024-08-05 10:12:07.771889"]]

  def edit
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "real real real real "], ["updated_at", "2024-08-05 10:20:15.722736"], ["id", 1]]